[{"model": "miniatures.gamingsystem", "pk": 1, "fields": {"name": "warhammer_40k", "friendly_name": "Warhammer 40,000"}}, {"model": "miniatures.gamingsystem", "pk": 2, "fields": {"name": "star_wars_legion", "friendly_name": "Star Wars: Legion"}}, {"model": "miniatures.gamingsystem", "pk": 3, "fields": {"name": "wh_aos", "friendly_name": "Warhammer: Age of Sigmar"}}, {"model": "miniatures.army", "pk": 1, "fields": {"name": "adeptus_astartes", "friendly_name": "Adeptus Astartes"}}, {"model": "miniatures.army", "pk": 2, "fields": {"name": "necrons", "friendly_name": "Necrons"}}, {"model": "miniatures.army", "pk": 3, "fields": {"name": "chaos", "friendly_name": "Chaos"}}, {"model": "miniatures.army", "pk": 5, "fields": {"name": "galactic_empire", "friendly_name": "Galactic Empire"}}, {"model": "miniatures.army", "pk": 6, "fields": {"name": "rebel_alliance", "friendly_name": "Rebel Alliance"}}, {"model": "miniatures.army", "pk": 7, "fields": {"name": "astra_militarum", "friendly_name": "Astra Militarum"}}, {"model": "miniatures.army", "pk": 8, "fields": {"name": "strmcast_etrnls", "friendly_name": "Stormcast Eternals"}}, {"model": "miniatures.miniature", "pk": 3, "fields": {"gamesys": 1, "sku": "PRI-INTRCS-ADE-WH40K-GW", "name": "Primaris Intercessors", "manufacturer": "Games Workshop Ltd.", "army": 1, "has_factions": true, "description": "A strong core of reliable and adaptable warriors that can lay down fire while advancing or holding down terrain is an invaluable aid to any tactician. In the case of strike forces bolstered by Primaris battle-brothers, this role is fulfilled by the Intercessor Squads. Capable of leveling overlapping salvoes of firepower, these squads often form the flexible fighting core of newly-founded Primaris Chapters – though of course many established Chapters have eagerly leveraged their abilities, fielding them alongside Tactical Squads.\r\n\r\nThis multi-part plastic kit contains the components necessary to assemble a set of 10 Primaris Intercessors. Wearing Mk X Tacticus armor in order to take advantage of its protection and mobility, they prove to be reliable and adaptable warriors, each armed with bolt rifles. Their bolt rifles can be 1 of 3 variants – the standard bolt rifle with sickle magazine, auto bolt rifle with overcharger and box magazine, or stalker bolt rifle with longer-range sight and straight magazine. There are 16 right-hand shoulder pads decorated with the iconography of the Intercessors – enough to cover each of the variant arms, including 2 with an open radio panel, 2 gesturing for their squad to halt, 2 holding combat knives and 2 firing bolt pistols. There are a total of 24 different heads available in this kit, covering helmeted and bare options.\r\n\r\nThe models can be assembled as either a 10-man squad, a squad of 9 Intercessors with a Sergeant or 2 separate 5-man squads, each with a Sergeant of their own. The Sergeants feature unique heads, with a helmet mag-locked to their belt, and unique tilting plates to help them stand out.\r\n\r\nReflecting their battlefield versatility, the Intercessors come with lots of extra details to be added to their armor – 12 pistol holsters (2 empty, for the Intercessors actually wielding them), 10 ammunition and grenade pouches, 6 combat knife scabbards (4 empty), 4 single grenade pouches and 4 bolt pistol ammunition pouches.\r\n\r\nThe Primaris Intercessors come as 266 components, and are supplied with 10 Citadel 32mm Round bases and a transfer sheet.", "date_added": "2021-04-10T16:46:39.079Z", "itemcount": 10, "stock": 5, "price": "135.00", "image_url": "https://www.games-workshop.com/resources/catalog/product/248x256/99120101190_PrimarisIntercessors01.jpg", "image": "99120101190_PrimarisIntercessors01.jpg"}}, {"model": "miniatures.miniature", "pk": 4, "fields": {"gamesys": 2, "sku": "DRTH-VDR-EMP-SWL-FFG", "name": "Darth Vader", "manufacturer": "Fantasy Flight Games", "army": 5, "has_factions": false, "description": "Hunt the last vestiges of the Jedi order with the highly detailed Darth Vader miniature featured in this expansion! Depicted marching forward with his lightsaber menacingly raised to strike down his foes, Darth Vader is sure to terrorize any opponent.", "date_added": "2021-04-10T16:51:46.454Z", "itemcount": 1, "stock": 3, "price": "35.00", "image_url": "https://images-cdn.fantasyflightgames.com/filer_public/2e/8a/2e8a0702-291c-46b2-8508-735ae65a699c/swl57_300x300.png", "image": "swl57_darth-vader.png"}}, {"model": "miniatures.miniature", "pk": 5, "fields": {"gamesys": 2, "sku": "LK-SKWLKR-REB-SWL-FFG", "name": "Luke Skywalker", "manufacturer": "Fantasy Flight Games", "army": 6, "has_factions": false, "description": "Restore hope to the galaxy as the first new Jedi in a generation with the Luke Skywalker miniature featured in this expansion pack, depicted wielding his newly-constructed lightsaber!", "date_added": "2021-04-10T16:53:34.891Z", "itemcount": 1, "stock": 2, "price": "35.00", "image_url": "https://images-cdn.fantasyflightgames.com/filer_public/8c/28/8c282c00-d66a-47dc-b286-e27ae7b48b94/jedi-luke-skywalker_cropped.png", "image": "jedi-luke-skywalker_cropped.png"}}, {"model": "miniatures.miniature", "pk": 6, "fields": {"gamesys": 2, "sku": "STRMTRP-UN-EMP-SWL-FFG", "name": "Stormtroopers Unit", "manufacturer": "Fantasy Flight Games", "army": 5, "has_factions": false, "description": "No image is more iconic and symbolic of the Empire’s power than the expressionless helmet of an Imperial Stormtrooper. These soldiers have been deployed on hundreds of worlds across the galaxy, and everywhere they go, they keep the boot of Imperial oppression firmly placed on the neck of all who resist.\r\n\r\nIn the Stormtroopers Unit Expansion, you’ll find seven Stormtrooper miniatures, identical to the ones included in the Star Wars: Legion Core Set, along with the unit card and upgrade cards that you need to add another unit of Stormtroopers to your army.s", "date_added": "2021-04-10T16:54:52.124Z", "itemcount": 7, "stock": 2, "price": "75.00", "image_url": "https://images-cdn.fantasyflightgames.com/filer_public/5f/c2/5fc266f8-1a37-42dd-ac1a-7281fc8fe30b/swl07_stormtroopers_p5.png", "image": "swl07_stormtroopers_p5.png"}}, {"model": "miniatures.miniature", "pk": 7, "fields": {"gamesys": 1, "sku": "LRD-CHA-WH40K-GW", "name": "Chaos Lord", "manufacturer": "Games Workshop Ltd.", "army": 3, "has_factions": true, "description": "A Chaos Lord is a tyrannical warrior king who lives to bathe in the blood of worlds. He strives to bring whole star systems to their knees in the name of his patron deities. Typified by merciless ambition and fierce pride, many of these champions of disorder were once noble Chapter Masters and Captains of the Adeptus Astartes, but long years of unremitting war have twisted their souls beyond recovery. \r\n\r\nThe Chaos Lord is multipart plastic kit. Previously only available in Warhammer Quest: Blackstone Fortress, the Chaos Lord is a single-posed, push-fit miniature. He is a potent HQ choice in a Chaos Space Marines army and makes for an excellent Warlord option to lead your forces. The Chaos Lord is equipped for close-ranged combat, with a powerful combination of plasma pistol and thunder hammer making him a great front-line fighter.\r\n\r\nThis kit builds one Chaos Lord. It is supplied in 6 plastic components and comes with one 40mm Citadel Round Base.", "date_added": "2021-04-10T16:58:00.609Z", "itemcount": 1, "stock": 3, "price": "90.00", "image_url": "https://www.games-workshop.com/resources/catalog/product/600x620/99070102014_CSMChaosLord01.jpg", "image": "99070102014_CSMChaosLord01.jpg"}}, {"model": "miniatures.miniature", "pk": 8, "fields": {"gamesys": 1, "sku": "OVRLRD-NEC-WH40K-GW", "name": "Necron Overlord", "manufacturer": "Games Workshop Ltd.", "army": 2, "has_factions": false, "description": "Commanding legion upon legion of deathless soldiers whose only purpose is to obey his every order, the Necron Overlord is a cold, calculating demigod. He has the pick of a multitude of arcane armaments of his ancient race – powerful artifacts that predate many of the galaxy’s greatest civilizations.\r\n\r\nThis 10-piece plastic kit makes one Necron Overlord armed with a warsycthe and resurrection orb. The model is supplied with a 40mm round base.", "date_added": "2021-04-10T17:02:39.147Z", "itemcount": 1, "stock": 1, "price": "90.00", "image_url": "https://www.games-workshop.com/resources/catalog/product/600x620/99070110004_NECOverlordLead.jpg", "image": "99070110004_NECOverlordLead.jpg"}}, {"model": "miniatures.miniature", "pk": 9, "fields": {"gamesys": 1, "sku": "CMSSR-YRK-AM-WH40K-GW", "name": "Commissar Yarrick", "manufacturer": "Games Workshop Ltd.", "army": 7, "has_factions": false, "description": "Commissar Yarrick is one of the greatest heroes in the entire Imperium. On Armageddon, it was Yarrick who inspired the Imperial Guardsmen to prodigious acts of sacrifice and courage. Indeed, so motivated were the soldiers in Yarrick's presence that not a single soldier was executed for cowardice, even in the face of overwhelming odds. It was at Hades Hive that Commissar Yarrick fought his hardest battle, and where he lost his right arm to the snapping battle klaw of an Ork Warboss. Fighting through pain and shock, Yarrick beheaded the Warboss and took that same klaw as his own, a symbol of his defiance against the Orks.\r\n\r\nThis pack contains Commissar Yarrick - a finely detailed resin cast kit that comes in three components and is supplied with a 25mm round base.", "date_added": "2021-04-10T17:05:34.368Z", "itemcount": 1, "stock": 3, "price": "50.00", "image_url": "https://www.games-workshop.com/resources/catalog/product/248x256/99800105001_YarrickNEW01.jpg", "image": "99800105001_YarrickNEW01.jpg"}}, {"model": "miniatures.miniature", "pk": 10, "fields": {"gamesys": 2, "sku": "RBL-TRP-REB-SWL-FFG", "name": "Rebel Troopers Unit", "manufacturer": "Fantasy Flight Games", "army": 6, "has_factions": false, "description": "The Rebel Troopers Unit Expansion features a full unit of seven Rebel Trooper miniatures, identical to the Rebel Troopers included in the Star Wars: Legion Core Set. This expansion also includes the unit card and an assortment of upgrade cards, inviting you to kit out your Rebel Troopers for any battlefield scenario.", "date_added": "2021-04-10T17:08:08.845Z", "itemcount": 7, "stock": 2, "price": "75.00", "image_url": "https://images-cdn.fantasyflightgames.com/filer_public/64/5b/645bd14a-8392-4a27-b346-f59274b0bf44/swl05_rebel-troopers_p5.png", "image": "swl05_rebel-troopers_p5.png"}}, {"model": "miniatures.miniature", "pk": 12, "fields": {"gamesys": 3, "sku": "SQTRS-SCET-WHAOS-GW", "name": "Sequitors", "manufacturer": "Games Workshop Ltd.", "army": 8, "has_factions": false, "description": "The line infantry of a Sacrosanct Chamber is comprised of its Sequitors, stern warriors who channel the tempest through the magical weaponry bequeathed to them by Sigmar. To be struck by such a warrior is to feel the energy of the storm discharging with thundercap force. Able to to channel magic into the armaments they carry, Sequitors specialise in switching swiftly between attack and defence, their mauls and maces capable of blasting apart gheists and daemons forever and their shields can turn aside even a Hexwraith’s ethereal scythe.", "date_added": "2021-04-20T11:00:03.986Z", "itemcount": 10, "stock": 3, "price": "150.00", "image_url": "https://www.games-workshop.com/resources/catalog/product/920x950/99120218040_StormcastSequitors01.jpg", "image": "99120218040_StormcastSequitors01.jpg"}}, {"model": "miniatures.miniature", "pk": 14, "fields": {"gamesys": 1, "sku": "PRI-CAP-ADE-WH40K-GW", "name": "Primaris Captain", "manufacturer": "Games Workshop Ltd.", "army": 1, "has_factions": true, "description": "Space Marine Captains are both superlative warriors and strategically gifted commanders who lead Space Marine companies into battle. Those Primaris Captains who favour Mk X Tacticus armour are amongst the most determined and unstoppable of their ilk, and they let nothing keep them from their duty.", "date_added": "2021-04-20T16:08:27.896Z", "itemcount": 1, "stock": 3, "price": "90.00", "image_url": "https://www.games-workshop.com/resources/catalog/product/920x950/99120101179_PrimarisCaptain01.jpg", "image": "99120101179_PrimarisCaptain01_OUz9TSG.jpg"}}, {"model": "miniatures.miniature", "pk": 16, "fields": {"gamesys": 1, "sku": "PRI-CHAP-ADE-WH40K-GW", "name": "Primaris Chaplain", "manufacturer": "Games Workshop Ltd.", "army": 1, "has_factions": true, "description": "The spiritual leaders of their Chapters, Chaplains are awe-inspiring warrior priests who administer rites, preserve rituals and perform ancient ceremonies of initiation, vindications and redemption that are as important to a Space Marine Chapter as its roll of honour or skill at arms. Every Chapter has its own Chaplain, acting as leader in both devotions and combat and second only to the company Captain in rank.", "date_added": "2021-04-21T09:16:09.884Z", "itemcount": 1, "stock": 3, "price": "90.00", "image_url": "https://www.games-workshop.com/resources/catalog/product/920x950/99120101180_PrimarisChaplain01.jpg", "image": "99120101180_PrimarisChaplain01_FoNSYHH.jpg"}}, {"model": "miniatures.miniature", "pk": 17, "fields": {"gamesys": 1, "sku": "CHA-MRNS-CHA-WH40K-GW", "name": "Chaos Space Marines", "manufacturer": "Games Workshop Ltd.", "army": 3, "has_factions": true, "description": "Not even the Space Marines are safe from the lure of Chaos. Whether they hail from the dark days of the Horus Heresy or turned traitor more recently, these baleful warriors combine their gene-given gifts with dark blessings and malefic sorceries, transformed by years of battle into fearless, superhuman reavers.\r\n\r\nChaos Space Marines are the core of any Chaos army. Equally at home shredding opponents at range with bolter fire as they are in bloody melee, these guys can be geared up for pretty much any purpose you want on the battlefield. Combined with your choice of Marks of Chaos, Chaos Icons and deadly weaponry, they've got a place in any of your army lists.", "date_added": "2021-04-21T12:53:18.889Z", "itemcount": 10, "stock": 3, "price": "134.97", "image_url": "https://www.games-workshop.com/resources/catalog/product/920x950/99120102098_CSMSquad01.jpg", "image": "99120102098_CSMSquad01.jpg"}}]